[
    {
        "id": 1,
        "title": "The newest couple on the AI Scene — and why we should all be rooting for them",
        "author": "Erin Foley",
        "date": "April 8th, 2024",
        "readTime": "4-minute read",
        "thumbnail": "/devin.png",
        "content": [
            "Since starting my programming journey in high school, older family members cheered me on with promises of employment when the time came — you'll never struggle to get a job, I was told. And while I love the rush of passing test cases or deploying a website as much as any other passionate computer scientist, the thriving job industry that I was told awaited me has been a great source of motivation.",
            "I only recently learned just how advanced Machine Learning has become. Advancements have been quiet for the bulk of the past 40 years, but rapid. Perhaps the most culturally-prominent form of Machine Learning is the LLM ChatGPT, wowing programmers and laypeople alike with its ability to imitate human thought and speech.",
            "My friends studying the humanities lament about how their jobs will be stolen. My brother, an investment banker, claims that all excel work will be replaced by AI within the next few years. And after about 20 minutes spent playing with GPT 4, I can't see how software engineering is safe, either. A generation once plagued by FOMO is now grappling with a more existential anxiety: FOBO (fear of being obsolete).",
            "On March 12th, Cognition Labs released Devin, the first software engineer AI tool. Devin's capabilities outmatch any I've seen so far. Unlike traditional programming assistants, Devin's abilities extend far beyond simple code suggestions. It operates within a sandboxed environment, incorporating the use of shells, code editors, and browsers to perform tasks startlingly similar to a human developer. From mimicking the creations of blog posts with hidden messages to building and deploying applications end-to-end, Devin represents a leap towards fully autonomous software development. Devin even trains and tunes its own AI models — including itself. Perhaps most impressively, Devin correctly solved 13.86% of the GitHub issues found in open source projects from SWE-bench, a notoriously difficult benchmark that evaluates software engineering performance.",
            "Soon after, on March 19th, Microsoft researchers introduced AutoDev, an automated framework that allows AI agents to autonomously perform SWE tasks. It uses a different approach than Devin: AutoDev delegates different SWE tasks to specialized AI agents, each tasked with different aspects of software development. This method allows for the decomposition of complex projects into manageable tasks, which are then autonomously executed by these agents. Think of AutoDev as the conductor of an orchestra, where each AI agent plays its part in harmony, requiring no human intervention to create a symphony of code.",
            "One could imagine that Devin and AutoDev, together, could both design software architecture and automate the development process. As a couple, they're essentially a full-fledged software engineer who doesn't need a daily $40 lunch voucher at the office.",
            "This doesn't sound all-too encouraging to an undergraduate entering the job scene in a two-year period punctuated by outcries of impending recession. At least, it didn't sound encouraging at first.",
            "Since taking my first introductory machine learning course this semester, I am no longer an AI sensationalist. I'm an AI super-fan, and I've come to be a super-fan of the potential duo that is Devin and AutoDev. Automating time-consuming tasks and rigorously implementing the less-exciting aspects of development will allow developers to focus on more interesting projects with larger potential impact, both internally and industry-wide.",
            "In fact, as GitHub Research presented at the Collision Conference, generative AI SWE tools could lead to an increase in developer productivity that will bring a global GDP boost of $1.5 trillion. There will be a projected ~45 million professional software developers in the world in 2030. On a sample of around 1,000,000 GitHub users, suggestions made by GitHub Copilot generative AI illustrated a 30% increase in productivity (accepting code improvements/revisions, etc). This means that by 2030, we could have the additional hands of 15 million \"developers.\" These additional developers are adding to productivity, not erasing the need for ours.",
            "I think of my sister, a 1L student who, once-a-year, asks me to code an app for her — she's had this travel app idea for years, but lacks a technical background. I see Devin and AutoDev allowing people like her, people with inspiring creativity yet no MS in ML to back up their visions for technology, to contribute to a rapidly-growing industry.",
            "It's people like these who will increase the diversity in an extremely homogenous field and thereby increase innovation in domains that matter. Let's recall the first seatbelts and airbags made in the 1950s — these technologies were developed in labs where men were allowed and women were not, leading to women having a 47 - 71% higher chance of serious injury than men.",
            "I see Devin and AutoDev not replacing software engineers, whose leadership decisions and problem identification skills will always be necessary (more necessary than capital, according to a Karat report), but allowing more problem solvers to enter the laboratory and contribute to human progress.",
            "Some of the tasks automated by Devin/AutoDev (documentation, debugging/testing — the more mundane aspects of SWE) might not be sought as vehemently in SWE job candidates. But an increased emphasis on product vision, problem solving, creativity, and drive to constantly improve a product/system may take this industry to a point of human-centered innovation once inhibited by the barriers to entry for SWE. To me and many others, these tenants of computer science drew me in more than any thriving job market.",
            "The Devin/AutoDev couple is not a parasite in the SWE industry, it is an opportunity for a symbiotic relationship that will redefine what it means to be a SWE and what it means to solve a problem, build a business, and change the world with code."
        ]
    }
]
